etl/web_service/Account_Activity_Summary_xPCN_Get.wsdl

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:dat="http://www.plexus-online.com/DataSource">
   <soapenv:Header/>
   <soapenv:Body>
      <dat:ExecuteDataSource>
         <!--Optional:-->
  <ExecuteDataSourceRequest xmlns="http://www.plexus-online.com/DataSource">
    <DataSourceKey>4814</DataSourceKey>
    <InputParameters>
      <InputParameter>
        <Value>123681</Value>
        <Name>@PCNs</Name>
        <Required>false</Required>
        <Output>false</Output>
      </InputParameter>
      <InputParameter>
        <Value>202201</Value>
        <Name>@Period_Start</Name>
        <Required>true</Required>
        <Output>false</Output>
      </InputParameter>
      <InputParameter>
        <Value>202201</Value>
        <Name>@Period_End</Name>
        <Required>true</Required>
        <Output>false</Output>
      </InputParameter>

    </InputParameters>
    <DataSourceName>Account_Activity_Summary_xPCN_Get</DataSourceName>
  </ExecuteDataSourceRequest>
  </dat:ExecuteDataSource>
   </soapenv:Body>
</soapenv:Envelope>